article/build-qt5-on-windows.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-16 Fri 09:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Windows 上源码构建 Qt5</title>
<meta name="author" content="Jinghui Hu" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../readme.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Windows 上源码构建 Qt5</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org08eba70">1. 系统要求</a></li>
<li><a href="#orgd91fa54">2. 许可证</a></li>
<li><a href="#orgee828ba">3. Windows</a></li>
<li><a href="#org7d88db9">4. 构建！</a>
<ul>
<li><a href="#org6a174c4">4.1. 构建示例</a></li>
<li><a href="#org71a5716">4.2. 开发者版本构建示例</a></li>
<li><a href="#org69db1a3">4.3. 提示</a></li>
</ul>
</li>
<li><a href="#org505c1b9">5. 从 git 构建 Qt5</a></li>
<li><a href="#org2a753f2">6. 文档</a></li>
</ul>
</div>
</div>
<div id="outline-container-org08eba70" class="outline-2">
<h2 id="org08eba70"><span class="section-number-2">1.</span> 系统要求</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Perl 5.8 或更高版本，安装 <a href="https://strawberryperl.com/">Strawberry Perl</a></li>
<li>Python 2.7 或更高版本，安装 <a href="https://www.python.org/">Python</a></li>
<li>支持 C++11 标准的 C++ 编译器，安装 VS 2022</li>
</ul>

<p>
有关其他平台的具体要求，请参阅以下页面的 "Setting up your machine" 部分：
<a href="http://wiki.qt.io/Get_The_Source">http://wiki.qt.io/Get<sub>The</sub><sub>Source</sub></a>
</p>
</div>
</div>
<div id="outline-container-orgd91fa54" class="outline-2">
<h2 id="orgd91fa54"><span class="section-number-2">2.</span> 许可证</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>开源用户 &lt;license&gt; = -opensource</li>
<li>商业用户 &lt;license&gt; = -commercial</li>
</ul>
</div>
</div>
<div id="outline-container-orgee828ba" class="outline-2">
<h2 id="orgee828ba"><span class="section-number-2">3.</span> Windows</h2>
<div class="outline-text-2" id="text-3">
<p>
打开命令提示符。确保以下工具可以在路径中找到：
</p>
<ul class="org-ul">
<li>支持的编译器（Visual Studio 2012 或更高版本， MinGW-builds gcc 4.9 或更高版本）</li>
<li>Perl 5.12 或更高版本   <a href="http://www.activestate.com/activeperl/">http://www.activestate.com/activeperl/</a></li>
<li>Python 2.7 或更高版本  <a href="http://www.activestate.com/activepython/">http://www.activestate.com/activepython/</a></li>
<li><p>
Ruby 1.9.3 或更高版本  <a href="http://rubyinstaller.org/">http://rubyinstaller.org/</a>
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #9370db;">cd</span> qt-everywhere-src-5.15.18
configure -prefix qtbase -opensource -nomake tests
nmake // jom // mingw32-make
</pre>
</div></li>
</ul>

<p>
为了加速 MSVC 下 qmake 的引导过程，可以在 configure 命令行中传递
"-make-tool jom"。如果不使用 jom，
将 "/MP" 添加到 CL 环境变量中是个不错的主意。
</p>
</div>
</div>
<div id="outline-container-org7d88db9" class="outline-2">
<h2 id="org7d88db9"><span class="section-number-2">4.</span> 构建！</h2>
<div class="outline-text-2" id="text-4">
<p>
使用典型的 `configure; make` 构建过程。一些相关的 configure 选项（请参阅 configure -help）：
</p>
<ul class="org-ul">
<li>-release              编译和链接 Qt 时关闭调试功能。</li>
<li>-debug                编译和链接 Qt 时打开调试功能。</li>
<li>-nomake tests         禁用测试构建以加快编译速度</li>
<li>-nomake examples      禁用示例构建以加快编译速度</li>
<li>-confirm-license      自动确认 LGPL 2.1 许可证。</li>
</ul>
</div>
