article/build-qt5-on-windows.org
** 构建示例
#+BEGIN_EXAMPLE
  C:\Qt\qt-everywhere-src-5.15.18> configure -prefix %CD%\qtbase -opensource -nomake tests
  + cd qtbase
  + C:\Qt\qt-everywhere-src-5.15.18\qtbase\configure.bat -top-level -prefix C:\Qt\qt-everywhere-src-5.15.18\qtbase -opensource -nomake tests
  Bootstrapping qmake ...

  ... 此处省略一千万字 ...

  Configure summary:

  Build type: win32-msvc (x86_64, CPU features: sse sse2)
  Compiler: msvc 194435222
  Configuration: sse2 aesni sse3 ssse3 sse4_1 sse4_2 avx avx2 avx512f avx512bw avx512cd avx512dq avx512er avx512ifma avx512pf avx512vbmi avx512vl compile_examples f16c largefile precompile_header rdrnd rdseed shani x86SimdAlways shared shared debug_and_release release debug build_all c++11 c++14 c++17 c++1z concurrent dbus no-pkg-config release_tools stl
  Build options:
    Mode ................................... debug and release; default link: debug; optimized tools
    Optimize release build for size ........ no
    Building shared libraries .............. yes
    Using C standard ....................... C89
    Using C++ standard ..................... C++17
    Relocatable ............................ yes
    Using precompiled headers .............. yes
    Using LTCG ............................. no
    Target compiler supports:
      SSE .................................. SSE2 SSE3 SSSE3 SSE4.1 SSE4.2
      AVX .................................. AVX AVX2
      AVX512 ............................... F ER CD PF DQ BW VL IFMA VBMI
      Other x86 ............................ AES F16C RDRAND SHA
    Build parts ............................ libs examples tools
    App store compliance ................... no
  Qt modules and options:
    Qt Concurrent .......................... yes
    Qt D-Bus ............................... yes
    Qt D-Bus directly linked to libdbus .... no
    Qt Gui ................................. yes
    Qt Network ............................. yes
    Qt Sql ................................. yes
    Qt Testlib ............................. yes
    Qt Widgets ............................. yes
    Qt Xml ................................. yes
  Support enabled for:
    Using pkg-config ....................... no
    udev ................................... no
    Using system zlib ...................... no
    Zstandard support ...................... no
  Qt Core:
    DoubleConversion ....................... yes
      Using system DoubleConversion ........ no
    GLib ................................... no
    iconv .................................. no
    ICU .................................... no
    Built-in copy of the MIME database ..... yes
    Tracing backend ........................ <none>
    Logging backends:
      journald ............................. no
      syslog ............................... no
      slog2 ................................ no
    PCRE2 .................................. yes
      Using system PCRE2 ................... no
  Qt Network:
    getifaddrs() ........................... no
    IPv6 ifname ............................ no
    libproxy ............................... no
    Schannel ............................... no
    OpenSSL ................................ no
      Qt directly linked to OpenSSL ........ no
    OpenSSL 1.1 ............................ no
    DTLS ................................... no
    OCSP-stapling .......................... no
    SCTP ................................... no
    Use system proxies ..................... yes
    GSSAPI ................................. no
  Qt Gui:
    Accessibility .......................... yes
    FreeType ............................... yes
      Using system FreeType ................ no
    HarfBuzz ............................... yes
      Using system HarfBuzz ................ no
    Fontconfig ............................. no
    Image formats:
      GIF .................................. yes
      ICO .................................. yes
      JPEG ................................. yes
        Using system libjpeg ............... no
      PNG .................................. yes
        Using system libpng ................ no
    Text formats:
      HtmlParser ........................... yes
      CssParser ............................ yes
      OdfWriter ............................ yes
      MarkdownReader ....................... yes
        Using system libmd4c ............... no
      MarkdownWriter ....................... yes
    EGL .................................... yes
    OpenVG ................................. no
    OpenGL:
      ANGLE ................................ yes
      Combined ANGLE Library ............... no
      Desktop OpenGL ....................... no
      Dynamic OpenGL ....................... yes
      OpenGL ES 2.0 ........................ no
      OpenGL ES 3.0 ........................ no
      OpenGL ES 3.1 ........................ no
      OpenGL ES 3.2 ........................ no
    Vulkan ................................. no
    Session Management ..................... yes
  Features used by QPA backends:
    evdev .................................. no
    libinput ............................... no
    INTEGRITY HID .......................... no
    mtdev .................................. no
    tslib .................................. no
    xkbcommon .............................. no
    X11 specific:
      XLib ................................. no
      XCB Xlib ............................. no
      EGL on X11 ........................... no
      xkbcommon-x11 ........................ no
  QPA backends:
    DirectFB ............................... no
    EGLFS .................................. no
    LinuxFB ................................ no
    VNC .................................... no
    Windows:
      Direct 2D ............................ yes
      DirectWrite .......................... yes
      DirectWrite 2 ........................ yes
  Qt Sql:
    SQL item models ........................ yes
  Qt Widgets:
    GTK+ ................................... no
    Styles ................................. Fusion Windows WindowsVista
  Qt PrintSupport:
    CUPS ................................... no
  Qt Sql Drivers:
    DB2 (IBM) .............................. no
    InterBase .............................. no
    MySql .................................. no
    OCI (Oracle) ........................... no
    ODBC ................................... yes
    PostgreSQL ............................. no
    SQLite2 ................................ no
    SQLite ................................. yes
      Using system provided SQLite ......... no
    TDS (Sybase) ........................... no
  Qt Testlib:
    Tester for item models ................. yes
  Serial Port:
    ntddmodm ............................... no
  Qt SerialBus:
    Socket CAN ............................. no
    Socket CAN FD .......................... no
    SerialPort Support ..................... yes
  Further Image Formats:
    JasPer ................................. no
    MNG .................................... no
    TIFF ................................... yes
      Using system libtiff ................. no
    WEBP ................................... yes
      Using system libwebp ................. no
  Qt QML:
    QML network support .................... yes
    QML debugging and profiling support .... yes
    QML just-in-time compiler .............. yes
    QML sequence object .................... yes
    QML XML http request ................... yes
    QML Locale ............................. yes
  Qt QML Models:
    QML list model ......................... yes
    QML delegate model ..................... yes
  Qt Quick:
    Direct3D 12 ............................ yes
    AnimatedImage item ..................... yes
    Canvas item ............................ yes
    Support for Qt Quick Designer .......... yes
    Flipable item .......................... yes
    GridView item .......................... yes
    ListView item .......................... yes
    TableView item ......................... yes
    Path support ........................... yes
    PathView item .......................... yes
    Positioner items ....................... yes
    Repeater item .......................... yes
    ShaderEffect item ...................... yes
    Sprite item ............................ yes
  QtQuick3D:
    Assimp ................................. yes
    System Assimp .......................... no
  Qt Scxml:
    ECMAScript data model for QtScxml ...... yes
  Qt Gamepad:
    SDL2 ................................... no
  Qt 3D:
    Assimp ................................. yes
    System Assimp .......................... no
    Output Qt3D GL traces .................. no
    Use SSE2 instructions .................. yes
    Use AVX2 instructions .................. no
    Aspects:
      Render aspect ........................ yes
      Input aspect ......................... yes
      Logic aspect ......................... yes
      Animation aspect ..................... yes
      Extras aspect ........................ yes
  Qt 3D Renderers:
    OpenGL Renderer ........................ yes
    RHI Renderer ........................... no
  Qt 3D GeometryLoaders:
    Autodesk FBX ........................... no
  Qt Wayland Client ........................ no
  Qt Wayland Compositor .................... no
  Qt Bluetooth:
    BlueZ .................................. no
    BlueZ Low Energy ....................... no
    Linux Crypto API ....................... no
    Native Win32 Bluetooth ................. no
    WinRT Bluetooth API (desktop & UWP) .... yes
    WinRT advanced bluetooth low energy API (desktop & UWP) . yes
  Qt Sensors:
    sensorfw ............................... no
  Qt Quick Controls 2:
    Styles ................................. Default Fusion Imagine Material Universal
  Qt Quick Templates 2:
    Hover support .......................... yes
    Multi-touch support .................... yes
  Qt Positioning:
    Gypsy GPS Daemon ....................... no
    WinRT Geolocation API .................. yes
  Qt Location:
    Qt.labs.location experimental QML plugin . no
    Geoservice plugins:
      OpenStreetMap ........................ yes
      HERE ................................. yes
      Esri ................................. yes
      Mapbox ............................... yes
      MapboxGL ............................. no
      Itemsoverlay ......................... yes
  QtXmlPatterns:
    XML schema support ..................... yes
  Qt Multimedia:
    ALSA ................................... no
    GStreamer 1.0 .......................... no
    GStreamer 0.10 ......................... no
    Video for Linux ........................ no
    OpenAL ................................. no
    PulseAudio ............................. no
    Resource Policy (libresourceqt5) ....... no
    Windows Audio Services ................. yes
    DirectShow ............................. yes
    Windows Media Foundation ............... yes
  Qt TextToSpeech:
    Flite .................................. no
    Flite with ALSA ........................ no
    Speech Dispatcher ...................... no
  Qt Tools:
    Qt Assistant ........................... yes
    Qt Designer ............................ yes
    Qt Distance Field Generator ............ yes
    kmap2qmap .............................. yes
    Qt Linguist ............................ yes
    Mac Deployment Tool .................... no
    makeqpf ................................ yes
    pixeltool .............................. yes
    qdbus .................................. yes
    qev .................................... yes
    Qt Attributions Scanner ................ yes
    qtdiag ................................. yes
    qtpaths ................................ yes
    qtplugininfo ........................... yes
    Windows deployment tool ................ yes
    WinRT Runner Tool ...................... no
  Qt Tools:
    QDoc ................................... no
  Qt WebEngine Build Tools:
    Use System Ninja ....................... no
    Jumbo Build Merge Limit ................ no
    Developer build ........................ no
    Sanitizer .............................. no
  Qt WebEngineCore:
    Embedded build ......................... no
    Full debug information ................. no
    Pepper Plugins ......................... yes
    Printing and PDF ....................... yes
    Proprietary Codecs ..................... no
    Spellchecker ........................... yes
    Native Spellchecker .................... no
    WebRTC ................................. yes
    PipeWire over GIO ...................... no
    Geolocation ............................ yes
    WebChannel support ..................... yes
    Kerberos Authentication ................ yes
    Extensions ............................. yes
  Qt WebEngineQml:
    Support Qt WebEngine Qml ............... yes
    UI Delegates ........................... yes
    Test Support ........................... no
  Qt WebEngineWidgets:
    Support Qt WebEngine Widgets ........... yes
  Qt PDF:
    Support V8 ............................. no
    Support XFA ............................ no
    Support XFA-BMP ........................ no
    Support XFA-GIF ........................ no
    Support XFA-PNG ........................ no
    Support XFA-TIFF ....................... no
    Bitcode support ........................ no
    Use static runtime ..................... no
  Qt PDF Widgets:
    Support Qt PDF Widgets ................. yes

  Note: No wayland-egl support detected. Cross-toolkit compatibility disabled.

  WARNING: QDoc will not be compiled, probably because libclang could not be located. This means that you cannot build the Qt documentation.

  Either ensure that llvm-config is in your PATH environment variable, or set LLVM_INSTALL_DIR to the location of your llvm installation.
  On Linux systems, you may be able to install libclang by installing the libclang-dev or libclang-devel package, depending on your distribution.
  On macOS, you can use Homebrew's llvm package.
  On Windows, you must set LLVM_INSTALL_DIR to the installation path.

  Qt is now configured for building. Just run 'nmake'.
  Once everything is built, Qt is installed.
  You should NOT run 'nmake install'.
  Note that this build cannot be deployed to other machines or devices.

  Prior to reconfiguration, make sure you remove any leftovers from
  the previous build.

  // 下面开启多核并行编译
  C:\Qt\qt-everywhere-src-5.15.18> set CL=/MP8

  C:\Qt\qt-everywhere-src-5.15.18> nmake

  Microsoft (R) 程序维护实用工具 14.44.35222.0 版
  版权所有 (C) Microsoft Corporation。  保留所有权利。

          cd qtbase\ && ( if not exist Makefile C:\Qt\qt-everywhere-src-5.15.18\qtbase\bin\qmake.exe -o Makefile C:\Qt\qt-everywhere-src-5.15.18\qtbase\qtbase.pro ) && "C:\Program Files\Microsoft Visual Studio\2022\Community\VC\Tools\MSVC\14.44.35207\bin\HostX64\x64\nmake.exe" -f Makefile
  Info: creating cache file C:\Qt\qt-everywhere-src-5.15.18\qtbase\.qmake.cache

  Microsoft (R) 程序维护实用工具 14.44.35222.0 版
  版权所有 (C) Microsoft Corporation。  保留所有权利。

          cd src\ && ( if not exist Makefile C:\Qt\qt-everywhere-src-5.15.18\qtbase\bin\qmake.exe -o Makefile C:\Qt\qt-everywhere-src-5.15.18\qtbase\src\src.pro ) && "C:\Program Files\Microsoft Visual Studio\2022\Community\VC\Tools\MSVC\14.44.35207\bin\HostX64\x64\nmake.exe" -f Makefile

#+END_EXAMPLE

