article/build-qt5-on-windows.org
** 开发者版本构建示例

#+BEGIN_SRC sh
./configure -developer-build <license>
make -j4
#+END_SRC

有关 configure 的各种选项的文档，请参阅 `./configure -help' 的输出。

上述示例将构建构建系统中默认启用的所有 Qt5 模块。

可以通过执行 `make module-<foo>' 来构建选定的模块及其依赖项。例如，仅构建 qtdeclarative 及其依赖的模块：

#+BEGIN_SRC sh
./configure -prefix $PWD/qtbase <license>
make -j4 module-qtdeclarative
#+END_SRC

如果您只对 Qt5 的一个子集感兴趣，这可以节省大量时间。

** 提示

子模块仓库 qtrepotools 包含对开发人员和发布工程师有用的脚本。考虑将 qtrepotools/bin 添加到您的 PATH 环境变量中以访问它们。

qtrepotools 中的 qt5_tool 有一些可能感兴趣的更多功能。 请尝试 `qt5_tool --help'。

* 从 git 构建 Qt5

有关更多信息，请参阅 [[http://wiki.qt.io/Building_Qt_5_from_Git][http://wiki.qt.io/Building_Qt_5_from_Git]] 和 README.git。
有关参考平台，请参阅 [[http://wiki.qt.io/Qt_5][http://wiki.qt.io/Qt_5]]。

* 文档

配置和编译 Qt 后，可以通过运行 "make docs" 来构建文档。

构建文档后，您需要使用以下命令安装它：
#+BEGIN_SRC sh
  make install_docs
#+END_SRC

文档安装在设置为 $QT_INSTALL_DOCS 的路径中。
运行 "qmake -query" 将列出 QT_INSTALL_DOCS 的值。

有关 Qt 5 文档的信息位于 qtbase/doc/README 中，或在以下页面：[[http://wiki.qt.io/Qt5DocumentationProject][http://wiki.qt.io/Qt5DocumentationProject]]

注意：文档构建仅在桌面平台上进行了测试。
