article/build-qt5-on-windows.html
<div id="outline-container-org71a5716" class="outline-3">
<h3 id="org71a5716"><span class="section-number-3">4.2.</span> 开发者版本构建示例</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-sh">./configure -developer-build &lt;license&gt;
make -j4
</pre>
</div>

<p>
有关 configure 的各种选项的文档，请参阅 `./configure -help' 的输出。
</p>

<p>
上述示例将构建构建系统中默认启用的所有 Qt5 模块。
</p>

<p>
可以通过执行 `make module-&lt;foo&gt;' 来构建选定的模块及其依赖项。例如，仅构建 qtdeclarative 及其依赖的模块：
</p>

<div class="org-src-container">
<pre class="src src-sh">./configure -prefix $<span style="color: #ffffff;">PWD</span>/qtbase &lt;license&gt;
make -j4 module-qtdeclarative
</pre>
</div>

<p>
如果您只对 Qt5 的一个子集感兴趣，这可以节省大量时间。
</p>
</div>
</div>
<div id="outline-container-org69db1a3" class="outline-3">
<h3 id="org69db1a3"><span class="section-number-3">4.3.</span> 提示</h3>
<div class="outline-text-3" id="text-4-3">
<p>
子模块仓库 qtrepotools 包含对开发人员和发布工程师有用的脚本。考虑将 qtrepotools/bin 添加到您的 PATH 环境变量中以访问它们。
</p>

<p>
qtrepotools 中的 qt5<sub>tool</sub> 有一些可能感兴趣的更多功能。 请尝试 `qt5<sub>tool</sub> &#x2013;help'。
</p>
</div>
</div>
</div>
<div id="outline-container-org505c1b9" class="outline-2">
<h2 id="org505c1b9"><span class="section-number-2">5.</span> 从 git 构建 Qt5</h2>
<div class="outline-text-2" id="text-5">
<p>
有关更多信息，请参阅 <a href="http://wiki.qt.io/Building_Qt_5_from_Git">http://wiki.qt.io/Building<sub>Qt</sub><sub>5</sub><sub>from</sub><sub>Git</sub></a> 和 README.git。
有关参考平台，请参阅 <a href="http://wiki.qt.io/Qt_5">http://wiki.qt.io/Qt<sub>5</sub></a>。
</p>
</div>
</div>
<div id="outline-container-org2a753f2" class="outline-2">
<h2 id="org2a753f2"><span class="section-number-2">6.</span> 文档</h2>
<div class="outline-text-2" id="text-6">
<p>
配置和编译 Qt 后，可以通过运行 "make docs" 来构建文档。
</p>

<p>
构建文档后，您需要使用以下命令安装它：
</p>
<div class="org-src-container">
<pre class="src src-sh">make install_docs
</pre>
</div>

<p>
文档安装在设置为 $QT<sub>INSTALL</sub><sub>DOCS</sub> 的路径中。
运行 "qmake -query" 将列出 QT<sub>INSTALL</sub><sub>DOCS</sub> 的值。
</p>

<p>
有关 Qt 5 文档的信息位于 qtbase/doc/README 中，或在以下页面：<a href="http://wiki.qt.io/Qt5DocumentationProject">http://wiki.qt.io/Qt5DocumentationProject</a>
</p>

<p>
注意：文档构建仅在桌面平台上进行了测试。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Last Updated 2026-01-16 Fri 09:25. Created by Jinghui Hu at 2026-01-16 Fri 00:00.</p>
</div>
</body>
</html>
